---
type: FamilyElementVisibility
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# FamilyElementVisibility

`Autodesk.Revit.DB.FamilyElementVisibility` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FamilyElementVisibility | — | `public FamilyElementVisibility ( FamilyElementVisibilityType visibilityType )` |
| Property | IsShownInCoarse | — | `public bool IsShownInCoarse { get ; set ; }` |
| Property | IsShownInFine | — | `public bool IsShownInFine { get ; set ; }` |
| Property | IsShownInFrontBack | — | `public bool IsShownInFrontBack { get ; set ; }` |
| Property | IsShownInLeftRight | — | `public bool IsShownInLeftRight { get ; set ; }` |
| Property | IsShownInMedium | — | `public bool IsShownInMedium { get ; set ; }` |
| Property | IsShownInPlanRCPCut | — | `public bool IsShownInPlanRCPCut { get ; set ; }` |
| Property | IsShownInTopBottom | — | `public bool IsShownInTopBottom { get ; set ; }` |
| Property | IsShownOnlyWhenCut | — | `public bool IsShownOnlyWhenCut { get ; set ; }` |
| Property | VisibilityType | — | `public FamilyElementVisibilityType VisibilityType { get ; }` |